In [ ]:
!pip install requests bs4 scikit-learn tweepy kiwipiepy IPython

In [ ]:
!pip install scipy numpy matplotlib seaborn statsmodels openpyxl

In [1]:
import pandas as pd

sample_data = {"a":[4,5,6],
               "b":[7,8,9],
               "c":[10,11,12]}

df = pd.DataFrame(sample_data)
df_index = pd.DataFrame(sample_data, index=[1,2,3])

In [2]:
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

## PIVOT 실습
1. 데이터를 추출

In [3]:
df_1 = pd.DataFrame(
    [[4, 7, 10],
     [5, 8, 11],
     [6, 9, 12]],
     index=[1, 2, 3],
     columns=['a', 'b', 'c']
)

In [4]:
df_1

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [ ]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two', 'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [11]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [12]:
df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

## CONCAT 실습
1. 데이터를 합칠 때 사용하는 함수 중 하나
2. 열 이름이 서로 일치하면 밑으로 연결됨.

3. 합쳐야 할 데이터프레임끼리 열 이름이 서로 일치하지 않다면 결측치로 처리함

In [13]:
data1 = [['a',1],
         ['b', 2]]
data2 = [['c',3],
         ['d', 4]]

df1 = pd.DataFrame(data1, columns=['letter', 'number'])
df2 = pd.DataFrame(data2, columns=['letter', 'number'])

display(df1)
display(df2)

  letter  number
0      a       1
1      b       2

  letter  number
0      c       3
1      d       4

In [14]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [15]:
df3 = pd.DataFrame([['e', 5, 'cat'], ['f', 6, 'dog']], columns=['letter', 'number', 'animal'])
pd.concat([df1, df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      e       5    cat
1      f       6    dog

In [17]:
pd.concat([df1, df3], join="inner")

  letter  number
0      a       1
1      b       2
0      e       5
1      f       6

In [18]:
df4 = pd.DataFrame([['bird' ,'polly'], ['monkey' ,'george']], columns=['animal' ,'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [ ]:
#가로 방향으로 합치기 axis=1
pd.concat([df1, df4], axis=1)

## sort_value()
1. 데이터를 정렬

In [ ]:
import numpy as np

df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})
display(df)

In [ ]:
df.sort_values(by=['col1'])

In [ ]:
df.sort_values(by=['col1'], ascending=False)

In [ ]:
df.sort_values(by=['col1', 'col2'])

In [ ]:
df.sort_values(by='col1', ascending=False, na_position='first')

## 인덱스 재정렬

In [ ]:
df = pd.DataFrame([1, 2, 3, 4, 5], index=[100, 29, 234, 1, 150], columns=['A'])
df

In [ ]:
df.sort_index()

In [ ]:
df.sort_index(ascending=False)

In [ ]:
#reset_index()
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                   index=['falcon', 'parrot', 'lion', 'monkey'],
                   columns=('class', 'max_speed'))

df

In [ ]:
df.reset_index()
#기존 인덱스가 열로 이동

In [ ]:
df.reset_index(drop=True)

## 값을 지우는 drop(), dropna()

In [ ]:
df = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A', 'B', 'C', 'D'])
df

In [ ]:
df.drop(columns=['B', 'C'])

In [ ]:
df.drop([0, 1])

In [ ]:
df.drop(index=[0, 1], columns=['B', 'C'])

In [ ]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy":[np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [np.nan, "1940-04-25", np.nan]})
df

In [ ]:
df.dropna()

In [ ]:
df.dropna(axis=1)

In [ ]:
df.dropna(subset=['name', 'toy'])

#  데이터 추출
- 단순하게 데이터를 정리할 목적으로만 추출

In [ ]:
import pandas as pd
df = pd.DataFrame({"ID": [1, 2, 3, 3, 5],
                   "국어": [80, 90, 75, 75, 90],
                   "영어": [85, 100, 70, 70, 95],
                   "수학": [75, 95, 65, 65, 80]})
df

In [ ]:
df[['국어', '영어']]

In [ ]:
df[df['국어'] > 80]

In [ ]:
df['국어'] > 80

In [ ]:
df.drop_duplicates()

In [ ]:
df.drop_duplicates(subset='국어')

In [ ]:
df.head(2)

In [ ]:
df.tail(2)

In [ ]:
df.sample(2)

In [ ]:
df.sample(frac=0.5)

# iloc[]와 loc[]
1. iloc와 loc도 데이터를 행을 기준으로 추출할 때 사용하는 함수이다.
2. 이 둘의 차이점은 iloc[]는 번호를 사용해서 데이터를 추출할 인덱스와 열을 지정하고
3. loc[]는 열 이름을 지정한다.
4. iloc[행 시작 번호:행 종료 번호, 열 시작 번호:열 종료 번호]

In [ ]:
df.iloc[0,2]

In [ ]:
df.iloc[1:3]

In [ ]:
df.iloc[:,:]

In [ ]:
df.iloc[1:4,:]

In [ ]:
df.iloc[1:4,:0]

In [ ]:
df.loc[:,['국어','영어']]

In [ ]:
df.loc[:0, ['국어','영어']]

In [ ]:
df.loc[df['국어']>=80, ['국어','수학']]

# 논리 연산자
1. python -> a and b // pandas -> a & b
2. python -> a or b // pandas -> a | b
3. python -> not a // pandas -> ~ a

In [ ]:
df[df['국어']==75]

In [ ]:
df[df['국어']!=75]

In [ ]:
df[df['국어']>=80]

In [ ]:
df[(df['영어']>=80)&(df['국어']>=80)]

In [ ]:
df[(df['수학']>=70)|(df['국어']>=80)]

In [ ]:
df[~(df['수학']>=70)]

# 데이터 요약
* 요약된 데이터는 전체 데이터 특징을 간단하고 정확히 정리함.

In [ ]:
import numpy as np
import pandas as pd
df = pd.DataFrame({"ID":[1, 2, 3, 4, 5],
                   "국어":[80, 90, 75, 100, 80],
                   "영어":[85, 100, 70, 70, 75],
                   "수학":[75, 95, 65, 95, np.nan]})
df

In [ ]:
df['영어'].value_counts()

In [ ]:
df.shape

In [ ]:
df['영어'].nunique()

In [ ]:
df['영어'].unique()

In [ ]:
df.describe()

In [ ]:
df.sum()

In [ ]:
df[['국어', '영어', '수학']].sum()

In [ ]:
df[['국어', '영어', '수학']].median()

In [ ]:
df['수학'].std()

# 결측치 처리
* dropna() 함수는 결측치를 삭제
* fillna()는 결측치에 특정값을 채우는 함수

In [ ]:
df.fillna(9999)

In [ ]:
df.fillna(df['수학'].mean())

# 열 생성
*

In [ ]:
df = pd.DataFrame({"A":range(1, 13), "B":np.random.randint(0, 12, size=12)})
df.head()

In [ ]:
df.assign(plus=lambda x:df['A'] + df['B'])

In [ ]:
df['plus_pu'] = df['A'] + df['B']

In [ ]:
df

In [ ]:
df = pd.DataFrame({"A":range(1, 13), "B":np.random.randint(0, 12, size=12)})
df['plus'] = df['A'] + df['B']

pd.qcut(df['plus'], 3, labels={"A", "B", "C"})

In [ ]:
df['category'] = pd.qcut(df['plus'], 3, labels={"A", "B", "C"})
df

# 데이터 그룹화
* 데이터를 그룹화한다는 것은 데이터 프레임에서 필요한 기준에 따라 새롭게 데이터 프레임을 정렬하는 것
* 큰 데이터를 가져오기 위해 시각화 라이브러리 seaborn을 가져온다.

In [ ]:
import seaborn as sns

df = sns.load_dataset("mpg")
df.head(3)

In [ ]:
df.groupby(by="origin").size()

In [ ]:
df.groupby(by="origin").min()

In [ ]:
df.groupby(by="origin").mean(numeric_only=True)

In [ ]:
df.groupby(by="origin")[["horsepower", "weight"]].mean()

## 순위를 구할 때 사용하는 rank()

In [ ]:
df = sns.load_dataset("mpg")

print(df['cylinders'].unique())
display(df.head(3))
display(df.tail(3))

In [ ]:
df['cylinders'].rank(ascending=False,method='min')

In [ ]:
df['cylinders'].rank(method='dense')

In [ ]:
df['cylinders'].rank(ascending=False, method='dense')

# 데이터 병합
* concat() 함수는 데이터를 이어 준다면 merge() 함수는 서로를 자연스럽게 융합시켜 주는 형태

In [ ]:
adf = pd.DataFrame({"x1": ["A", "B", "C"], "x2": [1, 2, 3]})
bdf = pd.DataFrame({"x1": ["A", "B", "D"], "x3": ["T", "F", "T"]})

display(adf)
display(bdf)

In [ ]:
pd.merge(adf, bdf, on='x1')

In [ ]:
pd.merge(adf, bdf, how='right', on='x1')

In [ ]:
pd.merge(adf, bdf, how='left', on='x1')

In [ ]:
pd.merge(adf, bdf, how='outer', on='x1')

# 경기도 인구 데이터 분석
https://data.gg.go.kr/portal/data/service/selectServicePage.do?page=1&sortColumn=&sortDirection=&infId=HH7N68ZBMYNCB7QE9OY927342034&infSeq=1&searchWord=%EC%A3%BC%EB%AF%BC%EB%93%B1%EB%A1%9D%EC%9D%B8%EA%B5%AC+%EC%A7%91%EA%B3%84+%ED%98%84%ED%99%A9

In [ ]:
import pandas as pd

import matplotlib.pyplot as plt

%matplotlib inline

plt.rc('font', family='Malgun Gothic')
plt.rcParams['axes.unicode_minus'] = False

import IPython.display
from matplotlib_inline.backend_inline import set_matplotlib_formats
IPython.display.set_matplotlib_formats = set_matplotlib_formats('retina')

In [ ]:
filepath = 'C:/Users/hisem/Desktop/DataAnalysisPython/1장/data/주민등록인구집계현황.csv'
population = pd.read_csv(filepath, encoding='euc-kr')
population.head(2)

In [ ]:
print("데이터 크기 :", population.shape)

In [ ]:
population.isnull().sum()

### 젊은 세대가 많이 사는 지역이 어디인지 정의
* 40대 이하 여성이 많이 사는 지역을 젊은 세대가 많이 사는 지역으로 정의
* 40대 이하 여성이 지역 맘카페에 가입하고, 학령기에 들어선 아이들의 학부모이기 때문

10대와 40대가 함께 살고 있으므로 해당 지역은 전체적으로 젊은 지역으로 간주할 수 있음

In [ ]:
popula_female = population.iloc[:, -12:]

popula_info = population.iloc[:, :4]

pop_female_info = pd.concat([popula_info, popula_female], axis=1)

In [ ]:
pop_female_info['연도'].value_counts().sort_index()

In [ ]:
pop_female_info = pop_female_info[pop_female_info['연도'] != 2025]

In [ ]:
pop_female_info.rename(columns={"0~9세 (여)": "10대_미만",
                                "10~19세 (여)": "10대",
                                "20~29세 (여)": "20대",
                                "30~39세 (여)": "30대",
                                "40~49세 (여)": "40대",
                                "50~59세 (여)": "50대",
                                "60~69세 (여)": "60대"
                                }, inplace=True)

In [ ]:
pop_female_info['70대_이상'] = pop_female_info["70~79세 (여)"] + \
                                pop_female_info["80~89세 (여)"] + \
                                pop_female_info["90~99세 (여)"] + \
                                pop_female_info["100세 이상 (여)"]
pop_female_info.info()

In [ ]:
df_female = pop_female_info.drop(['70~79세 (여)', '80~89세 (여)', '90~99세 (여)', '100세 이상 (여)'], axis=1)
df_female.head(2)

행정구역 중에 면, 리는 시골 지역이기 때문에 당연히 40대 이하 인구가 많이 살고 있지 않음 \
행정구역구분면에 '동'을 포함한 행만 가져온다.

In [ ]:
df_female_dong = df_female[df_female['행정구역명'].str.contains('동')]
df_female_dong.head()

__대 이하 여성들의 비율 = __대 이하 인구 합계 ÷ 해당 지역 전체 인구수 × 100

In [ ]:
under40s = df_female_dong['10대_미만'] + df_female_dong['10대'] + df_female_dong['20대'] + df_female_dong['30대'] + df_female_dong['40대']
over50s = df_female_dong['50대'] + df_female_dong['60대'] + df_female_dong['70대_이상']

under40_percent = round((under40s/df_female_dong['총 인구수 (여)']*100), 2)
over50_percent = round((over50s/df_female_dong['총 인구수 (여)']*100), 2)

df_female_dong['40대_이하_여성비율(%)'] = under40_percent
df_female_dong['50대_이상_여성비율(%)'] = over50_percent

df_female_dong[df_female_dong['연도']==2024]

행정구역명 -> 시와 동으로 분리 \
split() 함수 사용

In [ ]:
x = "경기도 고양시 덕양구 고양동"
print("split() 적용 전:", x)
print("split() 적용 후", x.split())
print("동 추출 결과 :", x.split()[-1])
print("시 추출 결과 :", x.split()[1])

In [ ]:
df_female_dong['동'] = df_female_dong['행정구역명'].apply(lambda x:x.split()[-1])
df_female_dong['시'] = df_female_dong['행정구역명'].apply(lambda x:x.split()[1])

In [ ]:
df_female_dong.sample()

시와 동 정보는 하나로 다시 합쳐서 열 추가 \
경기도에 시는 다르지만 동 이름이 같은 경우가 있기 때문

In [ ]:
df_female_dong['시-동'] = df_female_dong['시'] + " " + df_female_dong['동']
df_result = df_female_dong[['연도', '시', '동', '시-동', '총 인구수 (여)', '40대_이하_여성비율(%)', '50대_이상_여성비율(%)']]
df_result.isnull().sum()

데이터 프레임 전체에 연산을 적용하거나 필요한 데이터를 추출할 때마다 결측치를 확인해야 합니다.

In [ ]:
df_result[df_result['40대_이하_여성비율(%)'].isnull()]

In [ ]:
df_result.dropna(inplace=True)
df_result = df_result[df_result['연도']>2015]
df_result.sample(3)

In [ ]:
df_resent_group = df_result.groupby(['시-동'])[['40대_이하_여성비율(%)', "50대_이상_여성비율(%)"]].mean()
df_resent_group.reset_index(inplace=True)
df_resent_group.sort_values(by='40대_이하_여성비율(%)', ascending=False)[:20]

In [ ]:
df_top20 = df_resent_group.sort_values(by='40대_이하_여성비율(%)', ascending=False)[:20]
x = df_top20['시-동']
y = df_top20['40대_이하_여성비율(%)']

plt.figure(figsize=(10, 5))
plt.title("2016 ~ 2021년, 40대 이하 여성이 \n가장 많이 사는 지역 상위 20개 동", fontsize=15)
plt.bar(x, y, alpha=0.7, color='darkgreen')

plt.xticks(size=12, rotation=45)
plt.yticks(size=12)
plt.ylabel("%", size=15)
plt.ylim(70, 90)

plt.grid(True, alpha=0.2)

# 국민건강보험공단 진료 내역 정보 전처리
* 직접 함수를 만들고 데이터를 합치거나 병합하는 과정이 핵심

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

plt.rc('font', family='Malgun Gothic')
import IPython.display
from matplotlib_inline.backend_inline import set_matplotlib_formats
IPython.display.set_matplotlib_formats = set_matplotlib_formats('retina')

doctor_data = pd.read_csv('C:/Users/hisem/Desktop/DataAnalysisPython/1장/data/ph_2023.CSV', encoding='cp949')
doctor_data.head(2)

## 데이터 연결 및 필요한 열만 추출
* 진료과목코드, 주상병코드, 성별코드, 연령대코드를 파악해서 여성들을 나이별로 분류하고 어떤 진료를 자주 받고 어떤 병을 앓고 있는지 파악
* 처방 일수나 보험금 정보는 필요하지 않음

In [ ]:
target_cols = ['성별코드', '연령대코드', '진료과목코드', '주상병코드', '부상병코드']

doctor_data_short = doctor_data[target_cols]

print("2023년 진료행위 총 :", doctor_data_short.shape[0], "회")
doctor_data_short.head(2)

## 다른 데이터와 데이터 합치기 1
* 진료과목코드에 1로 저장되어 있으면 무슨 진료과목인지 알 수 없음.
* 코드 대신 정의로 대체하는 작업 \
url : https://opendata.hira.or.kr/op/opc/selectColumnCodeList.do?tblId=&pageIndex=8

In [ ]:
treat_code = pd.read_excel('C:/Users/hisem/Desktop/DataAnalysisPython/1장/data/컬럼정보_코드.xls')
treat_code = treat_code[treat_code['코드구분']=='진료과목코드']
treat_code.dropna(inplace=True)

treat_code.head(2)

In [ ]:
treat_code = treat_code[['코드','명칭']]
treat_code.rename(columns={'코드':'진료과목코드_str', '명칭':'진료과목'}, inplace=True)

treat_code.head(3)

In [ ]:
# zfill() 함수 실습
code = '1'
print("zfill()에 2로 지정하면", code.zfill(2))
print("zfill()에 3으로 지정하면", code.zfill(3))

In [ ]:
treat_code['진료과목코드_str'] = treat_code['진료과목코드_str'].apply(lambda x:str(x).zfill(2))
treat_code.head(3)

In [ ]:
doctor_data_short['진료과목코드_str'] = doctor_data_short['진료과목코드'].apply(lambda x:str(x).zfill(2))
doctor_data_short.reset_index(drop=True, inplace=True)
doctor_data_short.head(1)

In [ ]:
doctor_data_short = pd.merge(doctor_data_short, treat_code, how='left', on='진료과목코드_str')
doctor_data_short.head(2)

In [ ]:
print('2023년 진료과목별 진료횟수 Top20')
doctor_data_short['진료과목'].value_counts()[:20]

In [ ]:
x_hospitals = list(doctor_data_short['진료과목'].value_counts().index)
y_hos_values = doctor_data_short['진료과목'].value_counts().values
plt.figure(figsize=(6,10))
plt.barh(x_hospitals, y_hos_values)

## 다른 데이터와 데이터 합치기 2
* 상병코드 의미

In [ ]:
#데이터가 저장된 경로로 입력
disease_code = pd.read_csv('C:/Users/hisem/Desktop/DataAnalysisPython/1장/data/건강보험심사평가원_상병마스터_20240131.csv', encoding='cp949')
disease_code.head(2)

In [ ]:
disease_code = disease_code.iloc[:, :2]
disease_code.rename(columns={"상병기호":"주상병코드"}, inplace=True)
disease_code.head(2)

In [ ]:
doctor_data_short = pd.merge(doctor_data_short, disease_code, on='주상병코드', how='left')
doctor_data_short.head(2)

## 함수를 사용한 데이터 처리
* 성별코드와 연령대코드
* 성별코드에서 남자는 1 여자는 0
* 연령대코드는 숫자가 1~17 이상으로 증가

In [ ]:
def findSex(num):
    """성별코드를 해석하는 함수"""
    if num == 1:
        return '남'
    else:
        return '여'
    
def ageCode(num):
    """연령대 분류하는 함수"""
    if (num==1) or (num==2):
        return "9세미만"
    elif (num==3) or (num==4):
        return "10대"
    elif (num==5) or (num==6):
        return "20대"
    elif (num==7) or (num==8):
        return "30대"
    elif (num==9) or (num==10):
        return "40대"
    elif (num==11) or (num==12):
        return "50대"
    elif (num==13) or (num==14):
        return "60대"
    elif (num==15) or (num==16):
        return "70대"
    elif (num==17) or (num==18):
        return "80대"
    else:
        return "80대이상"

In [ ]:
doctor_data_short['성별'] = doctor_data_short['성별코드'].apply(lambda x:findSex(num=x))
doctor_data_short['연령대'] = doctor_data_short['연령대코드'].apply(lambda x:ageCode(num=x))
doctor_data_short.head(3)

In [ ]:
doctor_data_short.to_csv('C:/Users/hisem/Desktop/DataAnalysisPython/1장/data/2023_진료정보.csv', index=False)